Revit 2027 API
BuiltInFailures.EditingFailures.PinnedObjectHostDeleted Property
 Some pinned objects were deleted because their parent or host object was deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PinnedObjectHostDeleted { get; }
Public Shared ReadOnly Property PinnedObjectHostDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PinnedObjectHostDeleted {
	FailureDefinitionId^ get ();
}
static member PinnedObjectHostDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace